import re
支出 = dict(
            食品餐饮=dict(
                饮食='''([煨煮卤饺馍]|[^零]?食(?!戟之灵|的俘虏|.*争霸|[品物用神气人])|[^小灰]?汤(?![氏记家姆阴山泉河浴]|臣倍健|.?
                [村乡镇县市州])|煎(?![锅药])|炖(?![盅锅])|[^代套]?餐(?![具盘巾勺桌椅])|炒(?![锅勺冰货]|板栗|栗子)|蒸(?![笼屉锅片布箱柜汽]|桑拿)|
                [^爆轰]?炸(?![弹锅开药])|烤(?![箱架盘火炉盆])|[^喂]?饭(?![碗锅勺圈]))(?!.*([用器节]|套装|工具))|([烙馅灌飞剁烧]|千层|油酥|扣肉|
                酱香)饼|[火香干]锅|[粉面][店馆]|[家土]菜馆|[包早]点|([鲜汤大肉]|小笼)包|油条|([卤鱼渔拌凉]|螺蛳|[牛羊猪].{0,3}|花甲|石磨|.
                [杂脚蹄肉]|[海越]南)粉|(手工|[拉粉冷凉捞]|(biang|[担旦]){2}|刀削|[牛羊猪].{0,3}|[炸杂]酱|.[杂脚肉])[面麵麺]|锅盔|(特色|地方|
                家常|私房|[湘川鲁粤闵徽浙宽冒]|淮扬|江湖)菜|鸡公煲|新芙蓉|民间沙水|大米先生|老盛昌|爆好呷|李丸外|辣有味|沙县小吃|大排档|黑色[经金精]
                典|馄饨|麻辣|臭(豆腐|干子)|自助(海鲜|$|：)|[鸡牛羊]排|肯德基|麦当劳|疆尕尕|(德克|华莱)士|pizza|[披批比匹]萨|寿司|料理|汉堡|和宴厨
                |生鲜|蔬菜|菜铺|水产|干货|副食|豆制品|饮食|云吞|食堂|冻品|猪扒|潮发潮汕牛肉店|冻肉''',

                零食="零食|小吃|炒货|桥头排骨|卫龙|翻天娃|辣翻天|贤哥|饼干|(可丽||华夫|夹心|桃酥|鲜花|老婆|[雪月])饼|[果肉][脯干]|蜜饯|(盐津|良品)铺子|仙贝|浪味仙|妙脆角|([薯A]|山["
                            "药楂]|香蕉)片|辣[条片干根]|(棒棒|跳跳|泡泡|口香|彩虹|咖啡|[奶软硬酥]|酥油|牛扎|话梅|夹心|水果)糖|(小小|花生)酥|旺(旺仔)|可比克|乐事|绿箭|益达|炫迈|([冰雪蛋切]|["
                            "桂松梅]花|绿豆|灯芯|豆沙|酸枣)糕|干脆面|(唐僧|老鼠|素|麻辣)肉|^[^(文玩)]*核桃|(火山|怪味|兰花|巧克力|[蚕纳奶青糖])豆|花生|([瓜梅榛栗松菓贞]|葵花)子|(["
                            "干坚糖腰白]|碧根|开心|无花|罗汉|夏威夷)果|巴旦木|果([冻酱]|丹皮)|[凤鸡]爪|[鸭鹅]掌|食品店|[臭香]豆腐|广隆蛋挞王,",

                饮料酒水="[饮甜]品|果[汁肉酱]|星巴克|烧仙草|茶颜悦色|喜茶|奈雪的?茶|蜜雪冰城|CoCo都可|[柠檸]季|[一1]点点|乐乐茶|古茗|沪上阿姨|快乐"
                            "柠檬|书亦|益禾堂|贡茶|清补凉|茶百道|皇茶|农夫山泉|怡宝|恒大冰泉|百岁山|娃哈哈|可乐|雪碧|(芬|美年)达|红牛|战马|阿萨姆|营养"
                            "快线|茶π|元[気气氣]森林|东鹏|海之言|脉动|尖叫|维他(柠檬茶|豆?奶)|东方[树尿]叶|(崂山(蛇舌|圣)|苏打|巴黎|柠檬|纯净|矿泉|矿"
                            "物质)水|[格卡]瓦斯|酸梅汤|营养快线|(花生|o泡果|舒化|早餐|[酸椰牛羊驼猪狗豆炼鲜烤])[奶乳](?!奶)|冰糖雪梨|([椰豆橙]|沙棘|["
                            "苹芒]果|葡萄)汁|碧螺春|普洱|铁观音|毛尖|龙井|乌龙|黄芽|([红黑黄绿白奶果擂]|酥油|阿帕|芝麻豆子|冰红|茉莉花|蜂蜜柚子)茶|coffee|cake"
                            "拿铁|奶(果)茶|"),

            起居生活=dict(
                网话费="电信|联通|移动|宽带|流量|话费|通信专营|营业厅",
                日用品="顺客隆|昌大昌|沃尔玛|美宜佳|永旺|洗衣|宜家|IKEA|洗衣液|洗衣粉|厨房|垫子|蒸笼|日用品|曰用品|全家|百货|粮油|便利店|超市|便利购",
                房租还贷="公寓|房租|租金|房东|莫庆培|酒店",
                水电煤="([电水]|燃气)费|液化石油气|液化气((?!阀|管).)*",
                虚拟充值="加速器|(1号|畅.|影城|骑行)卡|[^(蚂蚁)]会员(?!购)|QQ(美化|号|音乐)|vip|迅雷|爱奇艺|优酷|腾讯视频|[红黄蓝绿黑粉紫彩魔]钻|网易云|虾米音乐|酷[狗我]|WPS|瓦力科技|高级账户|自动续费|连续包[年季月]",
                文具='剪刀|笔|尺'
            ),
            好物=dict(
                大好物='''Apple|米家|相机''',
                小好物="灯|桌|剃须|手环"
            ),
            出行交通=dict(
                打车="滴滴|高德|(出租|快)车|的士|打[的车]|代驾|出行",
                公交="雪球科技|地铁|公交|轨道|交通联合|(城市|琴岛|燕赵|武汉|盛京|⻓安|吉林|深圳|赣州|岭南|[泉绿甬]城|绍兴|天府|东莞|珠海|北京一卡|羊城)通|(潇湘|明珠|交?通)卡|公共交通|肇庆市肇庆通智能卡有限公司",
                火车="铁路|[火列动]车|高铁|城轨|中铁网络",
                高速费="通行费",
                共享单车="骑"
            ),

            休闲娱乐=dict(
                电影="影[城院]|(电影|淘票)票|猫眼电影|中影|王府井|cgv|潇湘国际|沃美|宽娱数码.+付费-《.+》|云视听",
                游戏="游戏|game|Steam|育碧|U(play|bisoft)|游(民星空|侠网)|点[券卡]|bili.*([^Bb]币|券)|腾讯|BUFF平台|超级蒸汽",
                娱乐="会所|网吧|保健"
            ),

            形象=dict(
                美妆护肤="洗面奶|面膜|卸妆[水棉油膏]|口红|唇彩|防晒|(水|润肤|身体|洁面)乳|(眼|护手)霜|爽肤|精[华油]|[乳唇]膏|凝胶|祛痘|(果|水杨)酸|粉底|欧莱雅|施华蔻|雅诗.?兰黛|美妆|发[油胶]|定型|啫喱|摩丝",
                理发="发廊|[美理烫染]发|洗剪吹|焗油|形象设计",
                衣裤鞋帽箱包="[衣裤鞋袜帽穿戴衫袖裙]|([遮太]阳|[眼墨])镜|([男女工时西上下正]|表演|社交|职业|运动|休闲|情侣|诱惑)装|T恤|皮草|披风|马甲|吊带|背心|肚兜|亵衣|[胸乳]罩|[文裹]胸|(羽绒|居家|作训|[常制汉]|工作|水手)服|外套|夹克|牛仔|"
                             "潮[牌流男]|耐克|nike|阿迪|361[度°]|鸿星尔克|特步|贵人鸟|七匹狼|李宁|美特斯邦威|优衣库|以纯|真维斯|花花公子|PLAYBOY|SEPTWOLVES|啄木鸟|TUCANO|恒源祥|hengyuanxiang|卡帝乐鳄鱼|CARTELO|班尼路|Baleno|嘉晔|JIAYE|罗蒙|"
                             "ROMON|皮尔卡丹|pierre ?cardin|富贵鸟|FUGUINIAO|布先生|森马|Semir|A21|拇指白小T|稻草人|迪卡侬",
            ),

            健康医疗=dict(
                医院="医([院馆生护用药]|.?室)|药([店房号业厂]|匣子)|诊所|卫生(服务(中心|站)|[院所室])|老百姓|海王星辰|(同仁|九芝)堂|甘之草科技|三七|黄芪|枸杞|菊花|甘草|红花|当归|石斛|凉茶|([白红沙玄党苦人]|西洋|花旗|太子)参|海(马|狗肾)|医院",
            ),

            其他=dict(
                快递费="[快速][递运]|百世汇通|物流|宅急送|(邮|寄[送件])费|丰巢|(妈妈|菜鸟)驿站|菜鸟裹裹|代收|投递站|邮政|EMS",
                保险="保[险单]|相互宝|准时[宝达]",
                团费="[会党团]费|共(青团|产党)",
                其他="京东",
                人情="转账|红包"
            ),
        )

收入 = {'工资': "工资|津贴|薪[水资金]|奖金|[绩效]{2}|(年终|全勤|半年|季度)奖", '收红包': "红包|转账|收款", '退款': "退款",
            '公积金': "公积金", '外快': "微拼|拼多多|点赞抽奖|其他", '提现': '提现'}


def classification(in_or_out, store, transaction_type):
    # 分类一级菜单和二级菜单,a需要匹配的字符串 ，b是收入支出
    rs = None
    if in_or_out == "支出":
        for i in 支出:
            print(支出)
            if rs is None:
                for x in 支出[i]:
                    dir_dir = 支出.get(i, {}).get(x)  # 3级的正则表达式
                    # print(dir_dir)
                    rs = re.search(dir_dir, store)
                    if rs is not None:
                        return i, x
        for i in 支出:
            if rs is None:
                for x in 支出[i]:
                    dir_dir = 支出.get(i, {}).get(x)  # 3级的正则表达式
                    # print(dir_dir)
                    rs = re.search(dir_dir, transaction_type)
                    # pass
                    if rs is not None:
                        return i, x
        # print(i,x)
        return "未分类", "未分类"
    if in_or_out == "收入":
        for i in 收入:
            # [工资，收红包，退款，公积金，外快]
            if rs is None:
                dir_dir = 收入[i]
                rs = re.search(dir_dir, transaction_type)
                if rs is not None:
                    return i, ""
                # print('1')
        return "未分类", "未分类"

    if in_or_out == "不计支出":
        return
if __name__ == '__main__':
    in_or_out = "支出"
    store = "盛景安护工"
    transaction_type = "盛景物业(南部战区总医院)现场项目组"
    cc = classification(in_or_out, store, transaction_type)
    # print(cc)
